import commentProfile from "@/shared/assets/article-comment-profile.png";
import commentProfile1 from "@/shared/assets/article-comment-profile2.png";
export const articleComments = [
  {
    id: 1,
    profile: commentProfile,
    title: "Осмонова Нурай",
    description: "Очень понравились уроки. Все более чем понятно! ",
  },
  {
    id: 2,
    profile: commentProfile1,
    title: "Эгембердиева Кунсулуу",
    description:
      "Классный урок, первый раз вижу такое подробное объяснение всего происходящего",
  },
  {
    id: 3,
    profile: commentProfile1,
    title: "Таалай Бирдемке",
    description:
      "Как мне кажется,  в конце видео, необходимо было сказать о том, что информация - это то(в данном случае число) с помощью чего можно устранить некую неопределенность(неизвестность) А так вроде все замечательно.",
  },
  {
    id: 4,
    profile: commentProfile,
    title: "Осмонова Нурай",
    description:
      "Мой первый день в мире программирования ✨ Первый ролик 😊 Вы просто гениально объясняете, продолжаю смотреть 😉  Спасибо!",
  },
];
