import card from "@/shared/assets/card.svg";
import heroImg from "@/shared/assets/article-hero-img.png";
export const articles = [
  {
    id: 1,
    isSubscribe: false,
    mainArticles: {
      image: card,
      description:
        "Мы подготовили подборку самых популярных курсов по направлению Java в IBS Training Center. ",
      data: "01.02.2022",
    },
    article_content: {
      title:
        "Мы подготовили подборку самых популярных курсов  по направлению Java в IBS Training Center.",
      description:
        "Когда-то ни один крупный проект не обходился без применения функционального и асинхронного программирования. Эти подходы до сих пор популярны за счет своих преимуществ: они помогают выдерживать большие нагрузки и писать эффективный код, не теряя в скорости разработки. ",
      image: heroImg,
      article_subtitle:
        "В рамках курса от IBS Training Center вы поймете, как работают основные фичи Spring Framework 5, и узнаете:",
      faq: [
        "Какие существуют конфигурации для Spring Framework 5;",
        "Как работать с REST-сервисами и документацией при помощи Swagger.",
        "Что такое бины и как с ними работать;",
        "Что такое Концепция IoC;",
        "Примеры использования AOP;",
      ],
      description_after_subscribe: {
        first:
          "Ищите способы ускорить проектирование приложений? Используйте Spring Framework 5. Этот легковесный каркас с открытыми исходными текстами не связан с конкретной моделью программирования и поэтому универсален. Его можно использовать не только для крупных корпоративных кейсов, но и для небольших проектов.",
        second:
          "Интересно? Присоединяйтесь к нашему курсу и узнайте об основных модулях этого фреймворка, вариантах их использования и как Spring Framework работает совместно с другими технологиями.",
        third:
          "Если вы уже знакомы с Spring Framework 5 и хотите углубить свои знания, то этот курс для вас! Вместе с IBS Training Center вы изучите темы, необходимые для профессионального применения Spring Framework на практике. Вы познакомитесь со Spring REST, HATEOAS и CORS, научитесь использовать сериализацию и ограничение данных, освоите тонкости применения аннотации @Transactional и оптимистических транзакций.",
        four: "Также вас ждет много практики, разбор реальных кейсов и другие важные темы",
      },
      fuck_after_subscribe: [
        "JWT-авторизация;",
        "Практическое применение реактивного программирования с использованием WebFlux;",
        "Тестирование Spring-сервисов",
        "Планировщик задач и Actuator",
      ],
    },
  },
  {
    id: 2,
    isSubscribe: false,
    mainArticles: {
      image: card,
      description:
        "Мы подготовили подборку самых популярных курсов по направлению Java в IBS Training Center. ",
      data: "01.02.2022",
    },
    article_content: {
      title:
        "Мы подготовили подборку самых популярных курсов  по направлению Java в IBS Training Center.",
      description:
        "Когда-то ни один крупный проект не обходился без применения функционального и асинхронного программирования. Эти подходы до сих пор популярны за счет своих преимуществ: они помогают выдерживать большие нагрузки и писать эффективный код, не теряя в скорости разработки. ",
      image: heroImg,
      article_subtitle:
        "В рамках курса от IBS Training Center вы поймете, как работают основные фичи Spring Framework 5, и узнаете:",
      faq: [
        "Какие существуют конфигурации для Spring Framework 5;",
        "Как работать с REST-сервисами и документацией при помощи Swagger.",
        "Что такое бины и как с ними работать;",
        "Что такое Концепция IoC;",
        "Примеры использования AOP;",
      ],
      description_after_subscribe: {
        first:
          "Ищите способы ускорить проектирование приложений? Используйте Spring Framework 5. Этот легковесный каркас с открытыми исходными текстами не связан с конкретной моделью программирования и поэтому универсален. Его можно использовать не только для крупных корпоративных кейсов, но и для небольших проектов.",
        second:
          "Интересно? Присоединяйтесь к нашему курсу и узнайте об основных модулях этого фреймворка, вариантах их использования и как Spring Framework работает совместно с другими технологиями.",
        third:
          "Если вы уже знакомы с Spring Framework 5 и хотите углубить свои знания, то этот курс для вас! Вместе с IBS Training Center вы изучите темы, необходимые для профессионального применения Spring Framework на практике. Вы познакомитесь со Spring REST, HATEOAS и CORS, научитесь использовать сериализацию и ограничение данных, освоите тонкости применения аннотации @Transactional и оптимистических транзакций.",
        four: "Также вас ждет много практики, разбор реальных кейсов и другие важные темы      ",
      },
      fuck_after_subscribe: [
        "JWT-авторизация;",
        "Практическое применение реактивного программирования с использованием WebFlux;",
        "Тестирование Spring-сервисов",
        "Планировщик задач и Actuator",
      ],
    },
  },
  {
    id: 3,
    isSubscribe: false,
    mainArticles: {
      image: card,
      description:
        "Мы подготовили подборку самых популярных курсов по направлению Java в IBS Training Center. ",
      data: "01.02.2022",
    },
    article_content: {
      title:
        "Мы подготовили подборку самых популярных курсов  по направлению Java в IBS Training Center.",
      description:
        "Когда-то ни один крупный проект не обходился без применения функционального и асинхронного программирования. Эти подходы до сих пор популярны за счет своих преимуществ: они помогают выдерживать большие нагрузки и писать эффективный код, не теряя в скорости разработки. ",
      image: heroImg,
      article_subtitle:
        "В рамках курса от IBS Training Center вы поймете, как работают основные фичи Spring Framework 5, и узнаете:",
      faq: [
        "Какие существуют конфигурации для Spring Framework 5;",
        "Как работать с REST-сервисами и документацией при помощи Swagger.",
        "Что такое бины и как с ними работать;",
        "Что такое Концепция IoC;",
        "Примеры использования AOP;",
      ],
      description_after_subscribe: {
        first:
          "Ищите способы ускорить проектирование приложений? Используйте Spring Framework 5. Этот легковесный каркас с открытыми исходными текстами не связан с конкретной моделью программирования и поэтому универсален. Его можно использовать не только для крупных корпоративных кейсов, но и для небольших проектов.",
        second:
          "Интересно? Присоединяйтесь к нашему курсу и узнайте об основных модулях этого фреймворка, вариантах их использования и как Spring Framework работает совместно с другими технологиями.",
        third:
          "Если вы уже знакомы с Spring Framework 5 и хотите углубить свои знания, то этот курс для вас! Вместе с IBS Training Center вы изучите темы, необходимые для профессионального применения Spring Framework на практике. Вы познакомитесь со Spring REST, HATEOAS и CORS, научитесь использовать сериализацию и ограничение данных, освоите тонкости применения аннотации @Transactional и оптимистических транзакций.",
        four: "Также вас ждет много практики, разбор реальных кейсов и другие важные темы      ",
      },
      fuck_after_subscribe: [
        "JWT-авторизация;",
        "Практическое применение реактивного программирования с использованием WebFlux;",
        "Тестирование Spring-сервисов",
        "Планировщик задач и Actuator",
      ],
    },
  },
  {
    id: 4,
    isSubscribe: false,
    mainArticles: {
      image: card,
      description:
        "Мы подготовили подборку самых популярных курсов по направлению Java в IBS Training Center. ",
      data: "01.02.2022",
    },
    article_content: {
      title:
        "Мы подготовили подборку самых популярных курсов  по направлению Java в IBS Training Center.",
      description:
        "Когда-то ни один крупный проект не обходился без применения функционального и асинхронного программирования. Эти подходы до сих пор популярны за счет своих преимуществ: они помогают выдерживать большие нагрузки и писать эффективный код, не теряя в скорости разработки. ",
      image: heroImg,
      article_subtitle:
        "В рамках курса от IBS Training Center вы поймете, как работают основные фичи Spring Framework 5, и узнаете:",
      faq: [
        "Какие существуют конфигурации для Spring Framework 5;",
        "Как работать с REST-сервисами и документацией при помощи Swagger.",
        "Что такое бины и как с ними работать;",
        "Что такое Концепция IoC;",
        "Примеры использования AOP;",
      ],
      description_after_subscribe: {
        first:
          "Ищите способы ускорить проектирование приложений? Используйте Spring Framework 5. Этот легковесный каркас с открытыми исходными текстами не связан с конкретной моделью программирования и поэтому универсален. Его можно использовать не только для крупных корпоративных кейсов, но и для небольших проектов.",
        second:
          "Интересно? Присоединяйтесь к нашему курсу и узнайте об основных модулях этого фреймворка, вариантах их использования и как Spring Framework работает совместно с другими технологиями.",
        third:
          "Если вы уже знакомы с Spring Framework 5 и хотите углубить свои знания, то этот курс для вас! Вместе с IBS Training Center вы изучите темы, необходимые для профессионального применения Spring Framework на практике. Вы познакомитесь со Spring REST, HATEOAS и CORS, научитесь использовать сериализацию и ограничение данных, освоите тонкости применения аннотации @Transactional и оптимистических транзакций.",
        four: "Также вас ждет много практики, разбор реальных кейсов и другие важные темы      ",
      },
      fuck_after_subscribe: [
        "JWT-авторизация;",
        "Практическое применение реактивного программирования с использованием WebFlux;",
        "Тестирование Spring-сервисов",
        "Планировщик задач и Actuator",
      ],
    },
  },
  {
    id: 5,
    isSubscribe: false,
    mainArticles: {
      image: card,
      description:
        "Мы подготовили подборку самых популярных курсов по направлению Java в IBS Training Center. ",
      data: "01.02.2022",
    },
    article_content: {
      title:
        "Мы подготовили подборку самых популярных курсов  по направлению Java в IBS Training Center.",
      description:
        "Когда-то ни один крупный проект не обходился без применения функционального и асинхронного программирования. Эти подходы до сих пор популярны за счет своих преимуществ: они помогают выдерживать большие нагрузки и писать эффективный код, не теряя в скорости разработки. ",
      image: heroImg,
      article_subtitle:
        "В рамках курса от IBS Training Center вы поймете, как работают основные фичи Spring Framework 5, и узнаете:",
      faq: [
        "Какие существуют конфигурации для Spring Framework 5;",
        "Как работать с REST-сервисами и документацией при помощи Swagger.",
        "Что такое бины и как с ними работать;",
        "Что такое Концепция IoC;",
        "Примеры использования AOP;",
      ],
      description_after_subscribe: {
        first:
          "Ищите способы ускорить проектирование приложений? Используйте Spring Framework 5. Этот легковесный каркас с открытыми исходными текстами не связан с конкретной моделью программирования и поэтому универсален. Его можно использовать не только для крупных корпоративных кейсов, но и для небольших проектов.",
        second:
          "Интересно? Присоединяйтесь к нашему курсу и узнайте об основных модулях этого фреймворка, вариантах их использования и как Spring Framework работает совместно с другими технологиями.",
        third:
          "Если вы уже знакомы с Spring Framework 5 и хотите углубить свои знания, то этот курс для вас! Вместе с IBS Training Center вы изучите темы, необходимые для профессионального применения Spring Framework на практике. Вы познакомитесь со Spring REST, HATEOAS и CORS, научитесь использовать сериализацию и ограничение данных, освоите тонкости применения аннотации @Transactional и оптимистических транзакций.",
        four: "Также вас ждет много практики, разбор реальных кейсов и другие важные темы      ",
      },
      fuck_after_subscribe: [
        "JWT-авторизация;",
        "Практическое применение реактивного программирования с использованием WebFlux;",
        "Тестирование Spring-сервисов",
        "Планировщик задач и Actuator",
      ],
    },
  },
  {
    id: 6,
    isSubscribe: false,
    mainArticles: {
      image: card,
      description:
        "Мы подготовили подборку самых популярных курсов по направлению Java в IBS Training Center. ",
      data: "01.02.2022",
    },
    article_content: {
      title:
        "Мы подготовили подборку самых популярных курсов  по направлению Java в IBS Training Center.",
      description:
        "Когда-то ни один крупный проект не обходился без применения функционального и асинхронного программирования. Эти подходы до сих пор популярны за счет своих преимуществ: они помогают выдерживать большие нагрузки и писать эффективный код, не теряя в скорости разработки. ",
      image: heroImg,
      article_subtitle:
        "В рамках курса от IBS Training Center вы поймете, как работают основные фичи Spring Framework 5, и узнаете:",
      faq: [
        "Какие существуют конфигурации для Spring Framework 5;",
        "Как работать с REST-сервисами и документацией при помощи Swagger.",
        "Что такое бины и как с ними работать;",
        "Что такое Концепция IoC;",
        "Примеры использования AOP;",
      ],
      description_after_subscribe: {
        first:
          "Ищите способы ускорить проектирование приложений? Используйте Spring Framework 5. Этот легковесный каркас с открытыми исходными текстами не связан с конкретной моделью программирования и поэтому универсален. Его можно использовать не только для крупных корпоративных кейсов, но и для небольших проектов.",
        second:
          "Интересно? Присоединяйтесь к нашему курсу и узнайте об основных модулях этого фреймворка, вариантах их использования и как Spring Framework работает совместно с другими технологиями.",
        third:
          "Если вы уже знакомы с Spring Framework 5 и хотите углубить свои знания, то этот курс для вас! Вместе с IBS Training Center вы изучите темы, необходимые для профессионального применения Spring Framework на практике. Вы познакомитесь со Spring REST, HATEOAS и CORS, научитесь использовать сериализацию и ограничение данных, освоите тонкости применения аннотации @Transactional и оптимистических транзакций.",
        four: "Также вас ждет много практики, разбор реальных кейсов и другие важные темы      ",
      },
      fuck_after_subscribe: [
        "JWT-авторизация;",
        "Практическое применение реактивного программирования с использованием WebFlux;",
        "Тестирование Spring-сервисов",
        "Планировщик задач и Actuator",
      ],
    },
  },
];
