export const courses = [
	{
		id: 'cm300nsmq000008i57sntds1o',
		title: 'Frontend-разработчик',
		description:
			'Мастер создания сайтов. Умеет делать их красивыми, интерактивными, с большим функционалом. Профессия отлично подойдет тем, кто хочет фрилансить и постоянно разрабатывать новые проекты',
		isBy: false,
		description2:
			'Идея реактивного программирования появилась сравнительно недавно, лет 10 назад. Что вызвало популярность этого относительно нового подхода и почему сейчас он в тренде, рассказал на конференции ',
		access: 'Навсегда',
		price: 46,
		duration: {
			modules: 3,
			materials: 60
		},
		course_about: {
			descriptions: [
				'Это всё, что ты видишь и кликаешь на сайте или в приложении - картинки, кнопочки, анимации и даже бесячая реклама.',
				'Самые главные инструменты frontend разработки сайтов это JavaScript, HTML и CSS.',
				'В Кыргызстане фронтенд-разработчики востребованы практически в каждой IT-компании. Это также одно из самых популярных направлений для фриланса и удаленной работы. Все потому, что в современном мире сайт нужен каждому'
			],
			this_for: 'Курс подойдет для людей с математическим складом ума.',
			learning: [
				'HTML',
				'Кроссплатформенность и кроссбраузерность',
				'CSS',
				'Управление версиями',
				'JavaScript',
				'Тестирование и отладка',
				'Soft skills (нетехнические навыки)'
				// 'Кроссплатформенность и кроссбраузерность',
				// 'Управление версиями',
				// 'Тестирование и отладка'
			]
		},
		results: {
			descriptions: [
				'С каждым днем, с каждым месяцем, с каждым годом вы будете физически ощущать, как ваши мечты и цели воплощаются в реальность. И каждый день, каждый год вы будете видеть, что вы живете той жизнью, которую сами для себя выбрали, и именно по тому сценарию, который вы сами для себя создали.',
				'Ваш новый навык планирования изменит вашу жизнь и поможет отточить умение выстраивать дела в правильной последовательности. Сначала вы будете видеть на неделю вперед, потом - на месяц, потом - на год, а потом вы будете видеть весь свой путь. Система планирования Кайдзен позволит вам правильно планировать правильные вещи и увеличить степень контроля над своей жизнью, чтобы сделать её счастливой и успешной.'
			],
			outcomes:
				'Учитесь, применяйте полученные на курсе знания и будьте счастливы!'
		},
		program: {
			modules: [
				'Reactivity',
				'Reactive approach',
				'Observable example',
				'Implementing and subscribing to an observer',
				'Reactive Streams spec',
				'Reactive Streams spec'
			]
		},
		learning_process: {
			steps: [
				'Вы получите доступ ко всем урокам мастер-класса и дополнительным материалам.',
				'Доступ к мастер-классам открыт 24/7. Вы сами решаете, когда у вас следующий урок.',
				'Вы сможете общаться и обмениваться мнениями с другими учениками в комментариях.',
				'Мы предоставляем вам бессрочный доступ к материалам любого оплаченного мастер-класса.'
			]
		},
		master_class_leader: {
			name: 'Евгений Александрович',
			title: 'Frontend developer'
		},
		student_reviews: [
			{
				name: 'Виктор Александарович',
				review:
					"С радостью оставляю положительный отзыв! Пройдя курс 'UX/UI Designer с нуля', я остался полностью доволен."
			},
			{
				name: 'Алина Татьянова',
				review: 'Лучшая школа в галактике и место, где я полюбил мир IT!'
			},
			{
				name: 'Эрлан Токтошев',
				review:
					'Спасибо за обучение, всё было правильно организовано и продумано.'
			},
			{
				name: 'Вадим',
				review:
					'Преподаватели всегда доброжелательны и готовы помочь с любыми вопросами.'
			},
			{
				name: 'Елизавета Хвостова',
				review:
					'Мне очень нравится Motion Web, и я ни разу не жалею о том, что поступила туда.'
			}
		],
		faq: [
			{
				question: 'Как мне начать обучение?',
				answer:
					'Очень просто – зарегистрироваться. Это займет всего несколько минут. Создайте свой аккаунт с помощью адреса электронной почты и номера телефона. Мастер-класс станет доступен сразу после оплаты.'
			},
			{
				question: 'Могу ли я отказаться от автопродления подписки?',
				answer: 'Да, вы можете отменить автопродление в любой момент.'
			},
			{
				question: 'Могу ли я вернуть деньги?',
				answer:
					'Возврат средств возможен в соответствии с условиями нашего возвратного политики.'
			}
		]
	},
	{
		id: 'cm300o6sh000108i5gbebddxj',
		title: 'Backend-разработчик',
		description:
			'Специалист, который отвечает за построение логики для воплощения любой идеи. Он собирает фундамент и опорную систему для проекта - от простого сайта для магазина одежды до сложных вычислительных систем нейронных сетей.',
		isBy: false
	},
	{
		id: 'cm300oeya000208i5ar28ggix',
		title: 'UX / UI Дизайнер',
		description:
			'Креативный специалист, который придумывает дизайн и интерфейс продукта. Специалист UX/UI отвечает за подбор форм, цветов, Функциональности дизайна и прочих важных параметров для комфорьного использования продукта.',
		isBy: true
	},
	{
		id: 'cm300oqcw000308i52wu976uu',
		title: 'DevOps - инженер',
		description:
			'Он разбирается в программировании и инфраструктуре и объединяет эти знания для оптимальной работы бизнеса.',
		isBy: false
	},
	{
		id: 'cm300p33d000408i5fa7k2vq9',
		title: 'Android-разработчик',
		description:
			'Создает, обновляет, усовершенствует мобильные приложения для смартфонов, планшетов, электронных книг, игровых приставок и других девайсов, работающих на операционной системе Android.',
		isBy: false
	},
	{
		id: 'cm300pa5k000508i50a1c7jjl',
		title: 'Java-разработчик',
		description:
			'Cпециалист, который создает приложения разной сложности, используя старейший язык программирования.',
		isBy: false
	},
	{
		id: 'cm300pfl0000608i52rmhh4vr',
		title: 'С++ - разработчик',
		description:
			'Занимается разработкой высокопроизводительных и высоконагруженных систем, таких как поисковики, драйверы, игры и приложения. ',
		isBy: false
	},
	{
		id: 'cm300pket000708i5a6dxgpgn',
		title: 'IOS - разработчик',
		description:
			'iOS разработчик - идеальная профессия для того, кто любит мобильную продукцию компании Apple. Специальность позволяет совмещать творческие способности.',
		isBy: false
	},
	{
		id: 'cm300pse4000808i588oi5z9t',
		title: 'Python - разработчик',
		description:
			'Cпециалист, который применяет в работе многоуровневый язык программирования Python.',
		isBy: true
	}
]
